app/Controllers/Signup_Login.php

INSERT INTO `user_accounts` (`firstname`, `lastname`, `email`, `phone_num`, `password`) VALUES ('chris wendell ', 'flaviano', 'cwf105@gmail.com', '09926636299', '$2y$10$1DppsuQpCLN/9HRsFpbhdebho.YVpb8bLvy2TCfEqlIS8qjAd/8ea')
---
    public function registerUserAccount()
    {
        $model = new UserAccounts();
        $email = $this->request->getPost('email');

        // Check if email already exists
        if ($model->where('email', $email)->first()) {
            return redirect()->back()->with('error', 'Email is already in use.');
        }

        $data = [
            'firstname' => $this->request->getPost('fname'),
            'lastname' => $this->request->getPost('lname'),
            'email' => $this->request->getPost('email'),
            'phone_num' => $this->request->getPost('pnum'),
            'password' => password_hash($this->request->getPost('pass'), PASSWORD_DEFAULT),
        ];

        // Check if passwords match
        if ($this->request->getPost('pass') !== $this->request->getPost('cpass')) {
            return redirect()->back()->with('error', 'Passwords do not match.');
        }

        // Save user data
        $model->save($data);